Revit 2018 API
Application.NewBuildingSiteExportOptions Method
Creates Building Site Export options.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Syntax
C#
public BuildingSiteExportOptions NewBuildingSiteExportOptions()
Visual Basic
Public Function NewBuildingSiteExportOptions As BuildingSiteExportOptions
Visual C++
public:
BuildingSiteExportOptions^ NewBuildingSiteExportOptions()
See Also
Application Class
Autodesk.Revit.Creation Namespace